Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinRoof Property
 The roof cannot be joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinRoof { get; }
Public Shared ReadOnly Property CannotJoinRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinRoof {
	FailureDefinitionId^ get ();
}
static member CannotJoinRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace